[
    {
        "summary": "What was the major takeaways from that last video for me? Let's actually take this break and let's pause and get our minds right. So let's get it.",
        "headline": "What was the major takeaways from that last video for me?",
        "start": 970,
        "end": 38542,
        "gist": "what was the last video for me"
    },
    {
        "summary": "In order to run a program, we got to understand what the program is. If a program is just a set of instructions, then running the program is pretty much initiating those instructions. When we double click on icons like i explained in the video with safari, that example, what we're doing is we're starting to run safari.",
        "headline": "In order to run a program, we got to understand what the program is.",
        "start": 38616,
        "end": 155754,
        "gist": "running a program"
    },
    {
        "summary": "Remember the information being information being data and it's being instructions. Some people may create sets of instructions that they may put in you. A virus is a set of instructions that someone else wrote that got into your system.",
        "headline": "A virus is a set of instructions that someone else wrote that got into your system.",
        "start": 155802,
        "end": 279590,
        "gist": "data is instructions"
    },
    {
        "summary": "What meditation really means is to become familiar with oneself. Understand the computer, understand yourself, and literally fix yourself. I hope you all start to internalize this information.",
        "headline": "What meditation really means is to become familiar with oneself.",
        "start": 280030,
        "end": 348280,
        "gist": "meditation is a calming of the brain"
    },
    {
        "summary": "I promise you it's going to make sense. After the first or second time, maybe even the third time, it's going to get there. We talk about communication, how computers out to communicate.",
        "headline": "We talk about communication, how computers out to communicate.",
        "start": 349630,
        "end": 368250,
        "gist": "don't let it stop"
    }
]