[
    {
        "summary": "There was a lot of technical terms thrown at shot, a lot of connections going back and forth. So before we even get to talking about more, we've got to close the our eyes and really bring our attention aside.",
        "headline": "There was a lot of technical terms thrown at shot, a lot of connections going back and forth.",
        "start": 970,
        "end": 35660,
        "gist": "not an information overload"
    },
    {
        "summary": "When i'm off camera and i do it by myself, i'd be going for at least 1020 , 30 , 40 , 50 minutes. Sometimes it's honestly one of the best escapes i could ever have.",
        "headline": "When i'm off camera and i do it by myself, i'd be going for at least 1020 , 30 , 40 , 50 minutes.",
        "start": 62830,
        "end": 91626,
        "gist": "10 to 20 seconds on camera"
    },
    {
        "summary": "The most significant part of this lesson was how we communicate. The most significant part was how we communicate, like sending information between computers. And i'm just going to start off with saying the most significant part was how we communicate.",
        "headline": "The most significant part of this lesson was how we communicate.",
        "start": 91698,
        "end": 118014,
        "gist": "what was that lesson about"
    },
    {
        "summary": "Microsoft word document is one package, and we chop it up into different packets. The reason we chop it up is because we don't want to send a huge ten gigabyte package through the network. With a computer and it's connected to an ethernet cord or just the network at a time, whenever it needs to communicate and stuff, it needs to break it up into sentences as well.",
        "headline": "With a computer and it's connected to an ethernet cord or just the network at a time, whenever it needs to communicate and stuff, it needs to break it up into sentences as well.",
        "start": 118122,
        "end": 232214,
        "gist": "what we typically send"
    },
    {
        "summary": "In the 21st century, computers aren't physically connected all the time. They are virtually connected through the ether. The ether is what connects every single thing together.",
        "headline": "The ether is what connects every single thing together.",
        "start": 232312,
        "end": 276842,
        "gist": "the ethereum and the ethereum"
    },
    {
        "summary": "Wifi uses frequencies to send messages through the ether. Frequencies are based off of zero and one pattern. We feed an image of zeros and ones where it can create a frequency based on that image. Another computer can pick up that same frequency and reconvert that frequency back to zeros and ones.",
        "headline": "Wifi uses frequencies to send messages through the ether.",
        "start": 276976,
        "end": 373386,
        "gist": "the power of zeros and ones"
    },
    {
        "summary": "Learn about antennas and how they convert actual digital values into the analog or how they convert digital values into way links or into frequencies. Our network card is called the pineal gland.",
        "headline": "Learn about antennas and how they convert actual digital values into the analog or how they convert digital values into way links or into frequencies.",
        "start": 373458,
        "end": 417546,
        "gist": "behind the scenes of the tech work"
    },
    {
        "summary": "When you make a thought, it's on a frequency. Your pineal gland turns that frequency from light energy back into an image. If it isn't picking up a correct frequency, how to handle the frequency that you already picked up that isn't correct.",
        "headline": "When you make a thought, it's on a frequency.",
        "start": 417678,
        "end": 650498,
        "gist": "connect us to the ether"
    },
    {
        "summary": "This week, dan explores the connection between humans and computers. In the first video, dan talks about the history of technology. In the second video, dan talks about how humans communicate with computers.",
        "headline": "In the second video, dan talks about how humans communicate with computers.",
        "start": 650584,
        "end": 768810,
        "gist": "john's favorite communication video"
    }
]