[
    {
        "summary": "This week on the channel, coder nate explains how computers communicate. Computers are just a representation of human beings, nate says.",
        "headline": "This week on the channel, coder nate explains how computers communicate.",
        "start": 910,
        "end": 47262,
        "gist": "how computers communicate"
    },
    {
        "summary": "Is it just the eyes, the visuals, the showing? For real, for real. But the real part of the computer is here. Honestly, you don't even need a display. It's this thing called a hellless computer. And honestly, that's usually how i use most of my computers. I have this computer, though, and it's upside down because it's connected to this other computer and they're connected by network cards.",
        "headline": "Honestly, you don't even need a display.",
        "start": 47276,
        "end": 71598,
        "gist": "the computer is upside down"
    },
    {
        "summary": "Two computers are connected physically with ethernet wire. When we send data between the computers, the data is sent over. The data is kind of like packaged up, right?",
        "headline": "When we send data between the computers, the data is sent over.",
        "start": 71624,
        "end": 155674,
        "gist": "the ethernet system and the wi - fi card"
    },
    {
        "summary": "When you send data, you break it up into smaller packets of like , 1gb at a time. This buffer allows us to store some data that's coming in from somewhere just for a temporary time. When we get something from another place, it's typically downloaded.",
        "headline": "When you send data, you break it up into smaller packets of like , 1gb at a time.",
        "start": 155722,
        "end": 314998,
        "gist": "how we send and receive data over the network"
    },
    {
        "summary": "How are they physically connected? Let's say this person is looking at this person. That's an eye. And so with humans, that's pretty much the same thing that's happening, right?",
        "headline": "And so with humans, that's pretty much the same thing that's happening, right?",
        "start": 315094,
        "end": 327658,
        "gist": "two physically connected people"
    },
    {
        "summary": "Cheer is talking to that person right here. This person is talking to that person. That person is talking to that person. Or that person is talking to that person.",
        "headline": "That person is talking to that person.",
        "start": 327754,
        "end": 350254,
        "gist": "that person is talking to you"
    },
    {
        "summary": "This is almost synonymous to the ethernet connection because the ethernet connection is showing that these two, they're literally physically connected here. We send the data back and forth between by talking and whatnot, right.",
        "headline": "This is almost synonymous to the ethernet connection because the ethernet connection is showing that these two, they're literally physically connected here.",
        "start": 350352,
        "end": 401640,
        "gist": "physical vs virtual connections"
    },
    {
        "summary": "We all have our own little network cars, if you will, that have our own little buffers that store information. When we think when we want to store something, that's how we do it. We put some emotion behind it. And then that kind of tells our brain to store that information for us so that we can retrieve it again whenever we want to feel that emotion.",
        "headline": "We all have our own little network cars, if you will, that have our own little buffers that store information.",
        "start": 402090,
        "end": 480606,
        "gist": "our own little network cars"
    },
    {
        "summary": "Ethernet was a physical cable that connected to computers. Ethernet or the ether is just everything. Like the ether is all this void around us, all these weird black space, dark energy.",
        "headline": "Like the ether is all this void around us, all these weird black space, dark energy.",
        "start": 480678,
        "end": 561390,
        "gist": "wi - fi and ethernet"
    },
    {
        "summary": "A frequency is a frequency of energy moving at a certain speed. When i think of a frequency, i actually think of just a sign graph like this. The more energy you have, the higher the graph is, the less energy you have, the smaller that graph is.",
        "headline": "A frequency is a frequency of energy moving at a certain speed.",
        "start": 561560,
        "end": 611442,
        "gist": "frequencies in the ether"
    },
    {
        "summary": "Learn how to make a graph that shows how much energy is used and how long it takes to do one revolution. Find out what the difference is between a graph that shows more energy and one that shows less energy. Use the weekly newsquiz to test your knowledge of stories you saw on cnn.com.",
        "headline": "Learn how to make a graph that shows how much energy is used and how long it takes to do one revolution.",
        "start": 611516,
        "end": 706222,
        "gist": "the speed of revolutions"
    },
    {
        "summary": "Energy is just frequency is just energy moving at a certain speed and a certain height. In a way, frequency is carrying information like you have radio waves. Visual things are in a wavelength.",
        "headline": "In a way, frequency is carrying information like you have radio waves.",
        "start": 706306,
        "end": 863494,
        "gist": "frequency and number of revolutions"
    },
    {
        "summary": "We use frequencies and wireless communication to pass information back and forth between computers. Antennas rattle back and forth at a certain speed, which will create a wave, and that wave gets shot out through the ether, and different antennas can pick up those waves. Our eyes is a system that picks up frequencies, and our brain processes those frequencies for us, and we see color.",
        "headline": "We use frequencies and wireless communication to pass information back and forth between computers.",
        "start": 863592,
        "end": 1057760,
        "gist": "frequencies tell us information"
    },
    {
        "summary": "Some people are more tapped into other people than other people. But we're all picking up these energies and whatnot. Like, we can actually communicate on a telepathic a** type s***.",
        "headline": "Like, we can actually communicate on a telepathic a** type s***.",
        "start": 1058210,
        "end": 1128690,
        "gist": "empathetic people give off energy"
    },
    {
        "summary": "On some real, steve job says, computer science teaches you how to think. Computers are showing us how we can push our capabilities as basic as humans to more superhumans, like telepathy.",
        "headline": "Computers are showing us how we can push our capabilities as basic as humans to more superhumans, like telepathy.",
        "start": 1128740,
        "end": 1174774,
        "gist": "computer science teaches you how to think"
    },
    {
        "summary": "Our pineal glands are picking up so much different energy to so many different frequencies. We process 60 to 70,000 different thoughts a day. And out of those 60 to 70,000 different thoughts, how many of them do you think is yours? Make sure you know who you are at the end of the day you know who's writing your programs and that you're not being programmed by the world.",
        "headline": "We process 60 to 70,000 different thoughts a day.",
        "start": 1174882,
        "end": 1301050,
        "gist": "how to be a better version of yourself"
    },
    {
        "summary": "How did we live in harmony with each other and our environment and the other animals around without language? It's because we already knew how to communicate without it. But i'm see on the next video ima get with y'all. Peace.",
        "headline": "How did we live in harmony with each other and our environment and the other animals around without language?",
        "start": 1301170,
        "end": 1324630,
        "gist": "before language was a technology"
    }
]