[
    {
        "summary": "What happens when you turn on your computer? What happens when you press the power button? What really happened? Loading stuff and an apple screen come on. What is happening in the background, huh? Well, this is the point of this video, and so we're going to tap into it. If you haven't seen it yet, go check it out. It's a real dope video. For real.",
        "headline": "What happens when you turn on your computer?",
        "start": 670,
        "end": 80502,
        "gist": "waking a computer"
    },
    {
        "summary": "What happens when we wake the f*** up, right? What happens when we brush our teeth, wash our face, and use the bathroom? What do i do on a normal basis?",
        "headline": "What happens when we wake the f*** up, right?",
        "start": 80516,
        "end": 121678,
        "gist": "what actually happens when we press that button"
    },
    {
        "summary": "This is just like a set of procedures, a set of commands, a set of actions that i'm following every single morning that i wake up to start my body up. But those are more like conscious ones. There are also some subconscious things that are happening that i don't even know that's happening.",
        "headline": "This is just like a set of procedures, a set of commands, a set of actions that i'm following every single morning that i wake up to start my body up.",
        "start": 121714,
        "end": 212600,
        "gist": "my morning routine"
    },
    {
        "summary": "When we press the power button and we turn the computer on, what's really happening is we get the battery. With that energy first? That energy first flows, from the negative. In the cpu, it's probably going straight to this place where there's this thing called the bios. In the brain, it goes to this place where it gets this instruction to start setting things up.",
        "headline": "When we press the power button and we turn the computer on, what's really happening is we get the battery.",
        "start": 213050,
        "end": 297410,
        "gist": "where does the first energy go"
    },
    {
        "summary": "When you wake up in the morning, your brain kind of doing that for you. When a computer wakes up, there's just some programs that are running. We store those programs into the cpu, and then we tell the computer that upon pressing the power button, always run these set of commands.",
        "headline": "When a computer wakes up, there's just some programs that are running.",
        "start": 297520,
        "end": 486790,
        "gist": "start up normally"
    },
    {
        "summary": "In this video, we'll show you how to log in to a new user on your computer. You'll need to take in all of the keystrokes and the permissions for that user. You'll then be able to see if that user is able to log in. It's because someone wrote the code for that to happen.",
        "headline": "You'll need to take in all of the keystrokes and the permissions for that user.",
        "start": 486850,
        "end": 540140,
        "gist": "bring in the data"
    },
    {
        "summary": "This was just talking about waking your computer, waking your system, waking your body. Man, these videos don't really go far like they're going to really help you understand you.",
        "headline": "Man, these videos don't really go far like they're going to really help you understand you.",
        "start": 540770,
        "end": 589530,
        "gist": "how to wake your system"
    },
    {
        "summary": "Computer science teaches you how to think, but it also teaches you how to think as well. Someone wrote these codes for us. Who wrote this code for us? The creator. He created all of us and he's the best programmer out here. He's the ultimate programmer.",
        "headline": "Computer science teaches you how to think, but it also teaches you how to think as well.",
        "start": 589640,
        "end": 646510,
        "gist": "the origin of programing"
    }
]