[
    {
        "summary": "How is a modern computer set up and how does it really work? The purpose of coding is to give this modern computer instructions to do the tasks that we as humans would do ourselves. The only thing is the computer does it in a really cool way, in a very efficient way.",
        "headline": "The purpose of coding is to give this modern computer instructions to do the tasks that we as humans would do ourselves.",
        "start": 850,
        "end": 57990,
        "gist": "how a modern computer works"
    },
    {
        "summary": "The monitor is to the computer as a usb port is to the computer. You can unplug that port and just take the monitor off and put another port on and put on a new monitor.",
        "headline": "The monitor is to the computer as a usb port is to the computer.",
        "start": 58040,
        "end": 104434,
        "gist": "the computer is the monitor"
    },
    {
        "summary": "The motherboard connects all of the pieces of the computer to each other. The battery is where the computer gets its energy. The circulatory system that the battery is using to have his energy keep flowing back and forth is the motherboard.",
        "headline": "The circulatory system that the battery is using to have his energy keep flowing back and forth is the motherboard.",
        "start": 104482,
        "end": 338046,
        "gist": "getting into the motherboard"
    },
    {
        "summary": "We can't forget about the main parts of the computer, which is the cpu and the ram. What you're starting to see is that, honestly, the computer that we looked at, the human and then we went to the computer and we said, oh, we're just going to make this like this.",
        "headline": "We can't forget about the main parts of the computer, which is the cpu and the ram.",
        "start": 338168,
        "end": 390654,
        "gist": "the cpu and ram"
    },
    {
        "summary": "We're using our brains to mentally control where we put this energy. The computer has all this energy flowing through it. The cpu is what people would call the brains of the computer.",
        "headline": "The computer has all this energy flowing through it.",
        "start": 390692,
        "end": 461600,
        "gist": "how the computer works with energy"
    },
    {
        "summary": "With humans, when we think and we do, we usually mix that in with some memories. The more things we see, the more things we store in our memories. Our memory is literally where we keeping our memories is just honestly a storage.",
        "headline": "Our memory is literally where we keeping our memories is just honestly a storage.",
        "start": 462890,
        "end": 655090,
        "gist": "the computer's internal storage"
    },
    {
        "summary": "What is the purpose of our short term memory if we even ask what is the purpose of the short term memory? Think of short term memory versus long term memory. In the short term memory, this is like things that we need right away.",
        "headline": "What is the purpose of our short term memory if we even ask what is the purpose of the short term memory?",
        "start": 655150,
        "end": 731338,
        "gist": "the purpose of our short term memory"
    },
    {
        "summary": "Ten terabytes. We have a bunch of terabytes of data and programs that we have stored in our heads and memory. What we typically do is we go to that long term memory whenever we want to pull like whenever we need to do an action, whenever we want to speak. So that's what the ram, the short term memory, that's what that's used for the short term memory is the ram.",
        "headline": "So that's what the ram, the short term memory, that's what that's used for the short term memory is the ram.",
        "start": 731374,
        "end": 803030,
        "gist": "how we think of snappy words in our heads"
    },
    {
        "summary": "This video explains how to use a computer's memory to learn programming skills. You can use the memory to learn skills while playing basketball. You can also use the memory to teach people how to code.",
        "headline": "You can also use the memory to teach people how to code.",
        "start": 803150,
        "end": 914520,
        "gist": "reusing basketball skills from another program"
    },
    {
        "summary": "In the computer, we actually are telling the computer literally to do that. Go ahead and take this process, store the information back, or remove this process from around. That's how our brains and computers literally really work.",
        "headline": "That's how our brains and computers literally really work.",
        "start": 914970,
        "end": 1072958,
        "gist": "how the computer works with memory"
    },
    {
        "summary": "Let's say we're taking data from the ram and putting it over to the displayport. So it's like, are you going to give me a five? And then bang, that's what we see on the screen, a five. When you get more into it, you'll see that. Oh, you don't see that the five is showing. Yeah, i really do.",
        "headline": "Let's say we're taking data from the ram and putting it over to the displayport.",
        "start": 1072994,
        "end": 1125322,
        "gist": "data over here"
    },
    {
        "summary": "At first, computers didn't really need to use a wifi card. Now computers can be connected to all other computers without even being physically connected. Humans also have a wifi card in our body, and we can send messages without speaking.",
        "headline": "Humans also have a wifi card in our body, and we can send messages without speaking.",
        "start": 1125336,
        "end": 1218434,
        "gist": "wi - fi in the body"
    },
    {
        "summary": "The cpu is like it's going all over the place. But the thing is, it's not really the cpu, it's the energy that's doing it. The cpu is just controlling the flow of that energy. This is breaking down computers so that you can understand what a computer is.",
        "headline": "This is breaking down computers so that you can understand what a computer is.",
        "start": 1218532,
        "end": 1322138,
        "gist": "wi - fi and computers"
    },
    {
        "summary": "You put in your usb ports right here and the usb ports, or you put your usb ports in right there and the usb ports will help you connect different external things to the world, to your body. You kind of think of usb port is when, let's say you have a transplant of something or a prosthetic arm or something. Like you're just taking an arm off and you put an arm on that's like usb port in a way like our whole bodies are.",
        "headline": "You put in your usb ports right here and the usb ports, or you put your usb ports in right there and the usb ports will help you connect different external things to the world, to your body.",
        "start": 1322224,
        "end": 1378250,
        "gist": "your body is a usb port"
    },
    {
        "summary": "This is computers for referral. Like you script stuff on a real you made it to the end. If you really understood what was happening there man like on some real key tapping in with me because this is computers, this is computer science this is human science this is thinking which most people don't do learn how to think remember computer science it's solving puzzles.",
        "headline": "If you really understood what was happening there man like on some real key tapping in with me because this is computers, this is computer science this is human science this is thinking which most people don't do learn how to think remember computer science it's solving puzzles.",
        "start": 1379470,
        "end": 1499110,
        "gist": "computers for referral"
    }
]