[
    {
        "summary": "This is the part where we review what we just got done learning. And i like to call this part the debrief. It's the part where we about to review what we just got done learning.",
        "headline": "And i like to call this part the debrief.",
        "start": 670,
        "end": 24522,
        "gist": "the debrief part"
    },
    {
        "summary": "I want you to integrate those frequencies into yourself so that you can actually make sense of it. As you're going through life, your body will naturally start processing these frequencies for you.",
        "headline": "I want you to integrate those frequencies into yourself so that you can actually make sense of it.",
        "start": 24656,
        "end": 65034,
        "gist": "integrate frequencies into yourself"
    },
    {
        "summary": "When you start feeling your heart, at first it may feel cold, it may feel solid, but first you just got to just ease into it. When you take time to relax and calm down and not have more thoughts being generated and process in your head, you get your brain that opportunity to actually store that information in the correct way.",
        "headline": "When you start feeling your heart, at first it may feel cold, it may feel solid, but first you just got to just ease into it.",
        "start": 65072,
        "end": 153054,
        "gist": "how to feel your heart"
    },
    {
        "summary": "Do this for at least two to three minutes to really get that flow and that feeling. Relax on the heart, telling yourself, no past, no future, just now, just the present moment. Do a couple of questions that i like to ask myself after i just got done learning something is okay.",
        "headline": "Do this for at least two to three minutes to really get that flow and that feeling.",
        "start": 153152,
        "end": 239800,
        "gist": "relax on the heart"
    },
    {
        "summary": "For me, it was honestly seeing the cpu, being seeing that the cpu was the controller of all things. I actually always jump to the cpu before we think about the cpu. Let's actually think about energy.",
        "headline": "For me, it was honestly seeing the cpu, being seeing that the cpu was the controller of all things.",
        "start": 240490,
        "end": 263234,
        "gist": "the video of the year"
    },
    {
        "summary": "For humans, what's really doing work for us is energy. The battery is what stores the energy. The motherboard is where all the energy really flows and connects everything together.",
        "headline": "The motherboard is where all the energy really flows and connects everything together.",
        "start": 263332,
        "end": 346850,
        "gist": "the motherboard is the key thing"
    },
    {
        "summary": "A computer's memory is the way that computers remember things. Data is the way that computers store their memories for us. When we have our long term memory, are we always remembering everything all the time? Our short term memory is like whenever we're using some information real recent, and we need to have it real quick. Those are the major parts of the computer, and that's really all there was to computers.",
        "headline": "A computer's memory is the way that computers remember things.",
        "start": 347650,
        "end": 513122,
        "gist": "the computer learns how to use energy"
    },
    {
        "summary": "You all really are tapped in. I'm going to see you on the next video, though, because i had you all too long in this one. Deuces.",
        "headline": "You all really are tapped in.",
        "start": 513196,
        "end": 519810,
        "gist": "you all are tapped in"
    }
]